## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                      |
|----------|-----------------------------------------------|
| update   | `aws_lb_listener_rule.pr_review[0]`           |
| recreate | `aws_lambda_permission.pr_review[0]`          |
|          | `aws_lb_target_group.pr_review[0]`            |
|          | `aws_lb_target_group_attachment.pr_review[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_permission.pr_review[0] must be replaced
-/+ resource "aws_lambda_permission" "pr_review" {
      ~ id                  = "AllowExecutionFromALB" -> (known after apply)
      ~ source_arn          = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_lb_listener_rule.pr_review[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "pr_review" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener-rule/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad/974b686ee3071568"
      ~ priority     = 1216 -> 1217
        tags         = {}
        # (3 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - condition {
          - host_header {
              - values = [
                  - "216.ai-answers.cdssandbox.xyz",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "217.ai-answers.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_target_group.pr_review[0] must be replaced
-/+ resource "aws_lb_target_group" "pr_review" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f",
        ] -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      ~ name                               = "ai-answers-pr-216" -> "ai-answers-pr-217" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      + protocol_version                   = (known after apply)
        tags                               = {
            "CostCentre" = "ai-answers-staging"
        }
      + vpc_id                             = "vpc-0659c9b2d7046368f"
        # (6 unchanged attributes hidden)

      ~ health_check (known after apply)
      - health_check {
          - enabled             = false -> null
          - healthy_threshold   = 5 -> null
          - interval            = 35 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - timeout             = 30 -> null
          - unhealthy_threshold = 2 -> null
            # (2 unchanged attributes hidden)
        }

      ~ stickiness (known after apply)
      - stickiness {}

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {}
          - unhealthy_state_routing {}
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # aws_lb_target_group_attachment.pr_review[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "pr_review" {
      ~ id               = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9-20250725141138110000000001" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers-pr-216/04ede2ee6d9ad4c9" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener_rule.pr_review[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.pr_review[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
